import tkinter as tk

root = tk.Tk()
root.title("学习新思想，争做新青年！！！")
button4 = tk.Button(root, text='''不知道说你什么好👋，罚你背诵三字经，🙍💢


📖三字经📖
                               【作者】王应麟【朝代】南宋
                               
                               
人之初，性本善。性相近，习相远。苟不教，性乃迁。教之道，贵以专。
昔孟母，择邻处。子不学，断机杼。卖燕山，有义方。教五子，名俱扬。
养不教，父之过。教不严，师之情。子不学，非所宜。幼不学，老何为。
玉不琢，不成器。人不学，不知义。为人子，方少时。亲师友，习礼仪。
香九龄，能温席。孝于亲，所当执。融四岁，能让梨。弟于长，宜先知。
首孝悌，次见闻。知某数，识某文。一而十，十而百。百而千，千而万。
三才者，天地人。三光者，日月星。三纲者，君臣义。父子亲，夫妇顺。
日春夏，日秋冬。此四时，运不穷。日南北，日西东。此四方，应乎中。
日水火，木金士。此五行，本乎数。十干者，甲至类。十二支，子至亥。
日黄道，日所躔。日赤道，当中权。赤道下，温暖极。我中华，在东北。
曰江河，日淮济。此四渎，水之纪。日岱华，嵩恒衡。此五岳，山之名。
日士农，日工商。此四民，国之良。日仁义，礼智信。此五常，不容紊。
地所生，有草木。此植物，遍水陆。有虫鱼，有鸟兽。此动物，能飞走。
稻粱菽，麦泰稷。此六谷，人所食。马牛羊，鸡犬豕。此六畜，人所饲。
日喜怒，日哀惧。爱恶欲，七情具。青赤黄，及黑白。此五色，目所识。
酸苦甘，及辛咸。此五味，口所含。膻焦香，及腥朽。此五臭，鼻所嗅。
匏士革，木石金。丝与竹，乃八音。日平上，目去入。此四声，宜调协。
高曾祖，父而身。身而子，子而孙。自子孙，至玄曾。乃九族，人之伦。
父子恩，夫妇从。兄则友，弟则恭。长幼序，友与朋。君则敬，臣则忠。
此十义，人所同。当师叙，勿违背。斩齐衰，大小功。至缌麻，五服终。
礼乐射，御书数。古六艺，今不具。惟书学，人共遵。既识字，讲说文。
有古文，大小篆。隶草继，不可乱。若广学，惧其繁。但略说，能知原。
凡训蒙，须讲究。详训话，明向读。为学者，必有初。小学终，至四书。
论语者，二十篇。群弟子，记善言。孟子者，七篇止。讲道德，说仁义。
作中庸，子思笔。中不偏，庸不易。作大学，乃曾子。自修齐，至平治。
孝经通，四书熟。如六经，始可读。诗书易，礼春秋。号六经，当讲求。
有连山，有归藏。有周易，三易详。有典谟，有训诰。有誓命，书之奥。
我周公，作周礼。著六官，存治体。大小戴，注礼记。述圣言，礼乐备。
曰国风，日雅颂。号四诗，当讽咏。诗既亡，春秋作。寓褒贬，别善恶。
三传者，有公羊。有左氏，有谷梁。经既明，方读子。撮其要，记其事。
五子者，有荀扬。文中子，及老庄。经子通，读诸史。考世系，知终始。
自義农，至黄帝。号三皇，居上世。唐有虞，号二帝。相揖逊，称盛世。
夏有禹，商有汤。周武王，称三王。夏传子，家天下。四百载，迁夏社。
汤伐夏，国号商。六百载，至纣亡。周武王，始诛纣。八百载，最长久。
周辙东，王纲坠。逞干戈，尚游说。始春秋，终战国。五霸强，七雄出。


时间不够啦，后面再添加其他功能模块，先让我这卑微的大学生拿点python学分吧😜
''', command=lambda: (""))
button4.pack(pady=10)
root.mainloop()
